app/controllers/produtos_controller.rb

  def create
    @produto = Produto.new(produto_params)

    respond_to do |format|
      if @produto.save
---
INSERT INTO "produtos" ("descricao", "valor", "quantidade", "fornecedores_id", "integer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["descricao", nil], ["valor", nil], ["quantidade", nil], ["fornecedores_id", nil], ["integer_id", nil], ["created_at", "2023-11-30 22:49:39.353402"], ["updated_at", "2023-11-30 22:49:39.353402"]]